Repository: GNOME/libsecret
Catalog: po/*.po
Languages: ug, uz

source: Received invalid secret from the secret storage
ug: مەخپىي ساقلىغۇچتىن ئىناۋەتسىز مەخپىيەتلىك تاپشۇرۇۋالدى
uz: Maxfiy saqlashdan yaroqsiz sir olindi

source: Default keyring
ug: كۆڭۈلدىكى شىفىرلىق ئاچقۇچ ھالقىسى
uz: Standart kalit

source: Couldn’t communicate with the secret storage
ug: مەخپىي ساقلىغۇچ بىلەن باغلىنالمايدۇ
uz: Maxfiy xotira bilan bogʻlanib boʻlmadi

source: the label for the new stored item
ug: يېڭى ساقلاش تۈرىنىڭ بەلگىسى
uz: yangi saqlangan element uchun yorliq

source: the collection in which to place the stored item
ug: تۈرنى ساقلايدىغان ئورۇننىڭ توپلىمى
uz: saqlangan elementni joylashtirish uchun to’plam

source: attribute value pairs of item to lookup
ug: تۈر سۈرۈشتۈرۈشكە ئىشلىتىدىغان خاسلىق قىممىتىنىڭ جۈپى
uz: qidiriladigan elementning atribut qiymati juftlari

source: attribute value pairs which match items to clear
ug: ماس كەلگەندىن كېيىن تازىلاشقا ئىشلىتىلىدىغان خاسلىق قىممىتىنىڭ جۈپى
uz: tozalash uchun elementlarga mos keladigan atribut qiymat juftlari

source: collection in which to lock
ug: قۇلۇپلايدىغان توپلام
uz: qulflanadigan to’plam

source: return all results, instead of just first one
ug: بىرىنچىسىنىلا ئەمەس بەلكى ھەممە نەتىجىنى قايتۇرىدۇ
uz: faqat birinchisini emas, barcha natijalarni qaytaring

source: unlock item results if necessary
ug: ئەگەر زۆرۈر بولسا تۈر نەتىجىسىنىڭ قۇلۇپىنى ئاچىدۇ
uz: agar kerak bo’lsa, element natijalarini qulfdan chiqaring
